1)Pandas is an open source data analysis library written in python

2)It leverages the power and speed of numpy to make data analysis and preprocessing
  easy for data scientists
  
3)It provides rich and highly robust data operations

PANDAS DATA STRUCTURE
Pandas has two types of data structures:

a) Series - It's a one dimensional array with indexes, it stores a single column or row of data in a Dataframe

b) Dataframe - It's a tabular spreadsheet like structure representing rows each of which contains one or
multiple columns

A one-dimensional array(labeled) capable of holding any type of data- Series

A two-dimensional data (labeled) structure with columns of potentially different types of data - DataFrame

In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1={
    "name":['suchit','azad','sunny','warrier'],
    "marks":[92,34,24,17],
    "city":['delhi','pune','banglore','antartica']
}

In [3]:
# this DataFrame just convert dictionary data into a frame like table and all
df=pd.DataFrame(dict1)

In [4]:
# given 0,1,2,3 are the indexes
df

      name  marks       city
0   suchit     92      delhi
1     azad     34       pune
2    sunny     24   banglore
3  warrier     17  antartica

In [5]:
# it just converts frame into the csv file with ".to_csv"

df.to_csv('friends.csv')

In [6]:
## if i want no indexing in csv file then 
df.to_csv('friends1.csv',index= False )

In [7]:
# if i want some indexes then 
# if nothing mentioned inside parenthesis then 4 indexes will be shown 
# and if we want that some specific should be there like 2 indexes or 3 then we will have to mention 
#it inside head like df.head(2) then top 2 indexes will be shown 

df.head(2)

     name  marks   city
0  suchit     92  delhi
1    azad     34   pune

In [8]:
#if i want from bottom the indexes then i will have to use the tail one like this 

df.tail(2)

      name  marks       city
2    sunny     24   banglore
3  warrier     17  antartica

In [9]:
#if i want to describe my whole data then it can be used 
df.describe()

          marks
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000

In [10]:
#if i want to read my csv file here from my desktop or system then it can be used 
suchit=pd.read_csv('friends.csv')

In [11]:
suchit

   Unnamed: 0     name  marks       city
0           0   suchit     92      delhi
1           1     azad     34       pune
2           2    sunny     24   banglore
3           3  warrier     17  antartica

In [12]:
suchit['marks'] ##getting specific column

0    92
1    34
2    24
3    17
Name: marks, dtype: int64

In [13]:
# i can locate it and make change inside the csv file like 
suchit['marks'][0]=50 ##colmn_name and then the row which i want to change

/var/folders/13/jrrkjcq52nn0t97d23j381p80000gn/T/ipykernel_4617/3687392211.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  suchit['marks'][0]=50 ##colmn_name and then the row which i want to change

In [14]:
suchit

   Unnamed: 0     name  marks       city
0           0   suchit     50      delhi
1           1     azad     34       pune
2           2    sunny     24   banglore
3           3  warrier     17  antartica

In [15]:
#again correcting it 
suchit['marks'][0]=92

/var/folders/13/jrrkjcq52nn0t97d23j381p80000gn/T/ipykernel_4617/1630025741.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  suchit['marks'][0]=92

In [16]:
suchit

   Unnamed: 0     name  marks       city
0           0   suchit     92      delhi
1           1     azad     34       pune
2           2    sunny     24   banglore
3           3  warrier     17  antartica

In [17]:
## I can change indexing too like this 
suchit.index=['first','second','third','fourth']
suchit

        Unnamed: 0     name  marks       city
first            0   suchit     92      delhi
second           1     azad     34       pune
third            2    sunny     24   banglore
fourth           3  warrier     17  antartica

In [18]:
## if i want to create series and random values of numpy as np then of random values (random) and then rand 
ser=pd.Series(np.random.rand)

In [19]:
type(ser)

pandas.core.series.Series

In [20]:
#if i want some series then can how much i want in series then rand(34) i will do 
ser=pd.Series(np.random.rand(4))
ser
#like this it occurs

0    0.706374
1    0.717709
2    0.574884
3    0.825342
dtype: float64

In [21]:
#if i want rows as well as columns in my dataframe then 
#as i am making rows and as well as columns so it is a DataFrame
newdf=pd.DataFrame(np.random.rand(10,4),index=np.arange(10))
##arange for indexing the DataFrame 
newdf.head()

          0         1         2         3
0  0.368491  0.695736  0.449061  0.665951
1  0.939320  0.239020  0.069279  0.450775
2  0.147909  0.322593  0.309509  0.921148
3  0.818030  0.562067  0.524611  0.462563
4  0.366788  0.459960  0.793369  0.516860

In [22]:
type(newdf)

pandas.core.frame.DataFrame

In [23]:
## it is showing float values 
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
dtype: object

In [24]:
## if i change the value in DataFrame then it's datatype property will also change accordingly like:-
newdf[0][0]='suchit'
# this will create 0th column to suchit

In [25]:
newdf.describe() ##telling the properties it is having

               1          2          3
count  10.000000  10.000000  10.000000
mean    0.458688   0.465547   0.588338
std     0.238790   0.226048   0.223598
min     0.005058   0.069279   0.287406
25%     0.339922   0.335476   0.453722
50%     0.437545   0.467521   0.591405
75%     0.662319   0.563185   0.704482
max     0.760599   0.793369   0.921148

In [26]:
## but it is showing object once editted with 0th column as 'suchit'
newdf.dtypes

0     object
1    float64
2    float64
3    float64
dtype: object

In [27]:
newdf.describe()

               1          2          3
count  10.000000  10.000000  10.000000
mean    0.458688   0.465547   0.588338
std     0.238790   0.226048   0.223598
min     0.005058   0.069279   0.287406
25%     0.339922   0.335476   0.453722
50%     0.437545   0.467521   0.591405
75%     0.662319   0.563185   0.704482
max     0.760599   0.793369   0.921148

In [28]:
## getting no. of index 
newdf.index

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9], dtype='int64')

In [29]:
##similarly no. of col.
newdf.columns

RangeIndex(start=0, stop=4, step=1)

In [30]:
newdf[0][0]=34

In [31]:
## converting into numpy array 
newdf.to_numpy()

array([[34, 0.6957363841592193, 0.4490607106218709, 0.6659508069353637],
       [0.9393198324760585, 0.23901960066812156, 0.06927932268536707,
        0.45077526344582797],
       [0.14790933894131497, 0.3225930523996646, 0.30950895023898595,
        0.9211476652119204],
       [0.8180298292735854, 0.562066584334418, 0.5246113788447015,
        0.4625633673613575],
       [0.3667880655630781, 0.4599600257384948, 0.7933685856544098,
        0.516860029561486],
       [0.44922066807652417, 0.005057683265151103, 0.7878688315926544,
        0.8932375133083387],
       [0.03837755346136984, 0.4151305204635871, 0.4133785536982587,
        0.6771502494944839],
       [0.5514841548296233, 0.7605987752025481, 0.5760425378163379,
        0.7135924516965568],
       [0.839922551516544, 0.734804108234863, 0.2463728082562635,
        0.28740639986275107],
       [0.1343410284607457, 0.3919084512408063, 0.4859821331484212,
        0.2946937681548589]], dtype=object)

In [32]:
## transposing the dataframe i.e, row <=> column
newdf.T

,0,1,2,3,4,5,6,7,8,9
0,34,0.93932,0.147909,0.81803,0.366788,0.449221,0.038378,0.551484,0.839923,0.134341
1,0.695736,0.23902,0.322593,0.562067,0.45996,0.005058,0.415131,0.760599,0.734804,0.391908
2,0.449061,0.069279,0.309509,0.524611,0.793369,0.787869,0.413379,0.576043,0.246373,0.485982
3,0.665951,0.450775,0.921148,0.462563,0.51686,0.893238,0.67715,0.713592,0.287406,0.294694

In [33]:
## sorting with indexing and columns 
## axis=0 does according to rows and axis =1 does according to columns 
newdf.sort_index(axis=0,ascending=False)
#if it would have ascending =True then it was going to be the same as it is

          0         1         2         3
9  0.134341  0.391908  0.485982  0.294694
8  0.839923  0.734804  0.246373  0.287406
7  0.551484  0.760599  0.576043  0.713592
6  0.038378  0.415131  0.413379  0.677150
5  0.449221  0.005058  0.787869  0.893238
4  0.366788  0.459960  0.793369  0.516860
3   0.81803  0.562067  0.524611  0.462563
2  0.147909  0.322593  0.309509  0.921148
1   0.93932  0.239020  0.069279  0.450775
0        34  0.695736  0.449061  0.665951

In [34]:
# with axis=1  , Same here 
newdf.sort_index(axis=1,ascending=False)

          3         2         1         0
0  0.665951  0.449061  0.695736        34
1  0.450775  0.069279  0.239020   0.93932
2  0.921148  0.309509  0.322593  0.147909
3  0.462563  0.524611  0.562067   0.81803
4  0.516860  0.793369  0.459960  0.366788
5  0.893238  0.787869  0.005058  0.449221
6  0.677150  0.413379  0.415131  0.038378
7  0.713592  0.576043  0.760599  0.551484
8  0.287406  0.246373  0.734804  0.839923
9  0.294694  0.485982  0.391908  0.134341

In [35]:
## differnece between view and copy 
newdf2=newdf #it creates view of newdf to newdf2 means any change in newdf2 will be reflected in newdf too 
newdf2[0][0]=12

In [36]:
newdf.head(2)

         0         1         2         3
0       12  0.695736  0.449061  0.665951
1  0.93932  0.239020  0.069279  0.450775

In [37]:
## if i want to copy then 
newdf2=newdf.copy()
## now if i will do any change in newdf2 then too it will show no change in original newdf
newdf2[0][0]=33
newdf.head(2)

/var/folders/13/jrrkjcq52nn0t97d23j381p80000gn/T/ipykernel_4617/1917557442.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf2[0][0]=33

         0         1         2         3
0       12  0.695736  0.449061  0.665951
1  0.93932  0.239020  0.069279  0.450775

In [38]:
## correcting it 
## changing with this method is not good as internally it is creating view or copy it has no guarantee so it is
## not good method of changing values in DataFrame
newdf[0][0]=34

/var/folders/13/jrrkjcq52nn0t97d23j381p80000gn/T/ipykernel_4617/4188052932.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf[0][0]=34

In [39]:
# .loc is used for this 
newdf.loc[0,0]=2
newdf.head(2)

         0         1         2         3
0        2  0.695736  0.449061  0.665951
1  0.93932  0.239020  0.069279  0.450775

In [40]:
newdf.loc[0,0]=34
newdf.head(2)

         0         1         2         3
0       34  0.695736  0.449061  0.665951
1  0.93932  0.239020  0.069279  0.450775

In [41]:
newdf.columns=list("abcd")
newdf.head(2)

         a         b         c         d
0       34  0.695736  0.449061  0.665951
1  0.93932  0.239020  0.069279  0.450775

In [42]:
newdf.loc[0,0]=654 #it just creates new column 
newdf.head(2)

         a         b         c         d      0
0       34  0.695736  0.449061  0.665951  654.0
1  0.93932  0.239020  0.069279  0.450775    NaN

In [43]:
# to remove 0
newdf.drop(0,axis=1) 
#if axis will not be given then column will not be deleted so for column it is axis=1 
# and for rows it is axis=0
newdf.head(2)

         a         b         c         d      0
0       34  0.695736  0.449061  0.665951  654.0
1  0.93932  0.239020  0.069279  0.450775    NaN

In [44]:
# if i want new dataframe from it then 
newdf.loc[[1,2],['c','d']] ##loc[[rows],[columns]]

          c         d
1  0.069279  0.450775
2  0.309509  0.921148

In [45]:
# if i want all colums from DataFrame then
newdf.loc[[1,2],:]

          a         b         c         d   0
1   0.93932  0.239020  0.069279  0.450775 NaN
2  0.147909  0.322593  0.309509  0.921148 NaN

In [46]:
# if i want all rows from DataFrame then
newdf.loc[:,["a","b"]]  ##.head() can also be applied further in it

          a         b
0        34  0.695736
1   0.93932  0.239020
2  0.147909  0.322593
3   0.81803  0.562067
4  0.366788  0.459960
5  0.449221  0.005058
6  0.038378  0.415131
7  0.551484  0.760599
8  0.839923  0.734804
9  0.134341  0.391908

In [47]:
# applying condition
newdf.loc[(newdf['a']<0.3) & newdf['c']>0.1]

          a         b         c         d   0
2  0.147909  0.322593  0.309509  0.921148 NaN
6  0.038378  0.415131  0.413379  0.677150 NaN
9  0.134341  0.391908  0.485982  0.294694 NaN

In [48]:
newdf

          a         b         c         d      0
0        34  0.695736  0.449061  0.665951  654.0
1   0.93932  0.239020  0.069279  0.450775    NaN
2  0.147909  0.322593  0.309509  0.921148    NaN
3   0.81803  0.562067  0.524611  0.462563    NaN
4  0.366788  0.459960  0.793369  0.516860    NaN
5  0.449221  0.005058  0.787869  0.893238    NaN
6  0.038378  0.415131  0.413379  0.677150    NaN
7  0.551484  0.760599  0.576043  0.713592    NaN
8  0.839923  0.734804  0.246373  0.287406    NaN
9  0.134341  0.391908  0.485982  0.294694    NaN

In [49]:
# iloc is used to locate the values in the DataFrame here in this numbering can be used 
# irrespective of the indexing name
newdf.iloc[0,4]

654.0

In [50]:
newdf.iloc[[0,5],[1,2]] 
## 0th row 1st column and 0th row 2nd column
## 5th row 1st column and 0th row 2nd column

          b         c
0  0.695736  0.449061
5  0.005058  0.787869

In [51]:
newdf.head(3)

          a         b         c         d      0
0        34  0.695736  0.449061  0.665951  654.0
1   0.93932  0.239020  0.069279  0.450775    NaN
2  0.147909  0.322593  0.309509  0.921148    NaN

In [52]:
newdf.drop([0],axis=0)
# if axis=0 then row will be dropped and if axis =1 then column will be dropped
# there will no change in newdf it just creates copy and follows the instructions 
# newdf.drop(['a','b'],axis=1)
## to change it in original newdf within it 
## there is use of inplace = true
newdf=newdf.drop([0],axis=1)
newdf.head()

          a         b         c         d
0        34  0.695736  0.449061  0.665951
1   0.93932  0.239020  0.069279  0.450775
2  0.147909  0.322593  0.309509  0.921148
3   0.81803  0.562067  0.524611  0.462563
4  0.366788  0.459960  0.793369  0.516860

In [56]:
## reset_index
## it just resets the index with new index columns  
newdf.reset_index().head()

   index         a         b         c         d
0      0        34  0.695736  0.449061  0.665951
1      1   0.93932  0.239020  0.069279  0.450775
2      2  0.147909  0.322593  0.309509  0.921148
3      3   0.81803  0.562067  0.524611  0.462563
4      4  0.366788  0.459960  0.793369  0.516860

In [59]:
## to remove index drop=true will be done 
newdf.reset_index(drop=True).head()

          a         b         c         d
0        34  0.695736  0.449061  0.665951
1   0.93932  0.239020  0.069279  0.450775
2  0.147909  0.322593  0.309509  0.921148
3   0.81803  0.562067  0.524611  0.462563
4  0.366788  0.459960  0.793369  0.516860

In [61]:
## isnull :- whereever there will be null there it will show true and others will be false 
newdf['b'].isnull().head()

0    False
1    False
2    False
3    False
4    False
Name: b, dtype: bool

In [63]:
df=pd.DataFrame({"name":['suchit','amit','warrier'],
                 "toy":[np.nan,'batmobile','bullwhip'],
                 "born":[pd.NaT,pd.Timestamp("1940-04-25"),pd.NaT]
                })

In [64]:
df.head()

      name        toy       born
0   suchit        NaN        NaT
1     amit  batmobile 1940-04-25
2  warrier   bullwhip        NaT

In [67]:
## now if i want to drop all na then
df.dropna() ## the rows where na are will be dropped

   name        toy       born
1  amit  batmobile 1940-04-25

In [ ]:
## it will drop that row only if all the row or column will have nan or naT
df.dropna(how='all')

In [68]:
## drop_duplicates
df.drop_duplicates(subset=['name'])
df
# df.drop_duplicates(subset=['name'],keep='first') //it will keep first duplicate
# df.drop_duplicates(subset=['name'],keep='last')  //it will keep last duplicate
# df.drop_duplicates(subset=['name'],keep=False)  //it will keep no duplicate

      name        toy       born
0   suchit        NaN        NaT
1     amit  batmobile 1940-04-25
2  warrier   bullwhip        NaT

In [71]:
## tells no. of rows and columns the df is having 
df.shape

(3, 3)

In [72]:
df.info() ## gives info about DataFrames

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   toy     2 non-null      object
 2   born    1 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(2)
memory usage: 200.0+ bytes

In [74]:
df['toy'].value_counts(dropna=True) ##  dropna=false will not drop na values while dropna =true will drop it

batmobile    1
bullwhip     1
Name: toy, dtype: int64

In [75]:
df['toy'].value_counts(dropna=False)

NaN          1
batmobile    1
bullwhip     1
Name: toy, dtype: int64

In [76]:
df.isnull()

    name    toy   born
0  False   True   True
1  False  False  False
2  False  False   True

In [77]:
df.notnull()

   name    toy   born
0  True  False  False
1  True   True   True
2  True   True  False

## homework
create a dataframe which contains only integers with 3 rows and 2 columns
run following dataframe on them
df.describe()
df.mean()
df.corr()
df.count()
df.max()
df.min()
df.median()
df.std()

In [82]:
##data=pd.read_excel('Book2.xlsx',sheet_name='sheet1 or sheet2')

In [ ]:
##data.iloc[0,0]=34

In [ ]:
##data.to_excel('Book2.xlsx',sheet_name='sheet2')